/* Used when showing an invalid entry or input encountered when expecting a formal entry such as a number of date */
"\\U201c%@\\U201d" = "”%@”";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C" = "Arvo on virheellinen.";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C.a" = "Arvo %@ on virheellinen.";

/* NSKeyValueValidationError, suggestion string when a numeric value of an user input is invalid (for example too small or too large) */
"Err1024-R" = "Valitse kelvollinen arvo.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C" = "Arvo on virheellinen.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C.a" = "Arvo %@ on virheellinen.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too small */
"Err2048-C.an" = "Arvo on liian pieni.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too large */
"Err2048-C.ax" = "Arvo on liian suuri.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-R" = "Valitse kelvollinen arvo.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small */
"Err2048-R.n" = "Valitse numero, joka on vähintään %@.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small or too large */
"Err2048-R.nx" = "Valitse numero väliltä %1$@ - %2$@.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too large */
"Err2048-R.x" = "Valitse numero, joka on enintään %@.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.an" = "Arvo %@ on liian pieni.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.ax" = "Arvo %@ on liian suuri.";

/* NSFileLockingError */
"Err255-C" = "Tiedostoa ei voitu lukita.";

/* NSFileLockingError */
"Err255-R" = "Tiedosto saattaa olla jo lukittu tai sinulla ei ole oikeutta lukita sitä.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "Tiedostoa ”%@” ei voitu lukita.";

/* NSFileReadUnknownError */
"Err256" = "Tiedostoa ei voitu avata.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "Tiedostoa ”%@” ei voitu avata.";

/* NSFileReadNoPermissionError */
"Err257" = "Tiedostoa ei voitu avata, koska sinulla ei ole oikeutta katsella sitä.";

/* NSFileReadNoPermissionError */
"Err257-C" = "Sinulla ei ole oikeutta.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "Jos haluat katsella tai muuttaa oikeuksia, valitse kohde Finderissa ja valitse Arkisto > Näytä tietoja.";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "Tiedostoa ”%@” ei voitu avata, koska sinulla ei ole oikeutta katsella sitä.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "Tiedostonimi oli virheellinen.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "Kohdetta ei voitu avata, koska tiedostonimi ”%@” on virheellinen.";

/* NSFileReadCorruptFileError */
"Err259" = "Tiedostoa ei voitu avata, koska se ei ole oikeassa muodossa.";

/* NSFileReadCorruptFileError */
"Err259-C" = "Tiedosto ei ole oikeassa muodossa.";

/* NSFileReadCorruptFileError */
"Err259-R" = "Tiedosto saattaa olla vioittunut, vajavainen tai odottamattomassa muodossa.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "Tiedostoa ”%@” ei voitu avata, koska se ei ole oikeassa muodossa.";

/* NSFileReadNoSuchFileError */
"Err260" = "Tiedostoa ei voitu avata, koska sitä ei ole olemassa.";

/* NSFileReadNoSuchFileError */
"Err260(Folder).f" = "Kansiota ”%@” ei ole olemassa.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "Tiedostoa ei ole olemassa.";

/* NSFileReadNoSuchFileError */
"Err260-C(Folder)" = "Kansiota ei ole olemassa.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "Tiedostoa ”%@” ei voitu avata, koska kyseistä tiedostoa ei ole.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "Tiedostoa ei voitu avata käyttäen määriteltyä tekstikoodausta.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "Määriteltyä tekstikoodausta ei voida käyttää.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "Tekstikoodausta %@ ei voida käyttää.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "Tiedosto on ehkä tallennettu toisella merkkikoodauksella tai se ei ole tekstitiedosto.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "Tiedostoa ei voitu avata käyttäen tekstikoodausta %@.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "Tiedostoa ”%2$@” ei voitu avata käyttäen tekstikoodausta %1$@.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "Tiedostoa ei voitu avata, koska määriteltyä osoitetyyppiä ei tueta.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "Määriteltyä osoitetyyppiä ei tueta.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "Tiedostoa ”%1$@” ei voitu avata, koska osoitetyyppiä %2$@ ei tueta.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "Tiedostoa ei voitu avata, koska osoitetyyppiä %@ ei tueta.";

/* NSFileReadTooLargeError */
"Err263" = "Kohdetta ei voitu avata, koska se on liian suuri.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "Kohde on liian suuri.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "Kohdetta ”%@” ei voitu avata, koska se on liian suuri.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "Tiedostoa ei voitu avata, koska sisällön tekstikoodausta ei voitu määrittää.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "Sisällön tekstikoodausta ei voitu määrittää.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "Voit ehkä avata tiedoston määrittämällä tekstikoodauksen.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "Tiedostoa ”%@” ei voitu avata, koska sen sisällön tekstikoodausta ei voida määrittää.";

/* NSUserCancelledError */
"Err3072-C" = "Toiminto kumottiin.";

/* NSFeatureUnsupportedError */
"Err3328" = "Pyydettyä toimintoa ei voitu suorittaa loppuun, koska toimintoa ei tueta.";

/* NSFeatureUnsupportedError, argument is a file name */
"Err3328(Trash).f" = "Tiedostoa ”%@” ei voitu siirtää roskakoriin, koska taltiolla ei ole roskakoria.";

/* NSFeatureUnsupportedError, argument is a file name and volume name */
"Err3328(Trash).fv" = "Tiedostoa ”%1$@” ei voitu siirtää roskakoriin, koska taltiolla ”%2$@” ei ole roskakoria.";

/* NSFeatureUnsupportedError */
"Err3328-C" = "Pyydetty toimintoa ei tueta.";

/* NSFeatureUnsupportedError */
"Err3328-C(Trash)" = "Taltiolla ei ole roskakoria.";

/* NSPropertyListCorruptError */
"Err3840" = "Dataa ei voitu lukea, koska se on korruptoitunut.";

/* NSPropertyListCorruptError */
"Err3840-C" = "Data on vioittunut.";

/* NSPropertyListUnknownVersionError */
"Err3841" = "Dataa ei voitu lukea, koska se on muodossa, jota tämä ohjelma ei ymmärrä.";

/* NSPropertyListUnknownVersionError */
"Err3841-C" = "Data on muodossa, jota tämä ohjelma ei ymmärrä.";

/* NSPropertyListReadStreamError */
"Err3842" = "Dataa ei voitu lukea, koska datan lähteessä on virhe.";

/* NSPropertyListReadStreamError */
"Err3842-C" = "Datan lähteessä tapahtui virhe.";

/* NSPropertyListWriteStreamError */
"Err3851" = "Dataa ei voitu kirjoittaa, koska datan kohteessa on virhe.";

/* NSPropertyListWriteStreamError */
"Err3851-C" = "Datan kohteessa tapahtui virhe.";

/* NSFileNoSuchFileError, argument is a folder name */
"Err4(Folder).f" = "Kansiota ”%@” ei ole olemassa.";

/* NSFileNoSuchFileError, first arg: source file, second arg: destination file */
"Err4(Move).fp" = "Kohdetta ”%1$@” ei voitu siirtää kohteeseen ”%2$@”, koska jompaakumpaa ei ole olemassa.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "Kohdetta ”%@” ei voitu poistaa.";

/* NSFileNoSuchFileError */
"Err4-C" = "Tiedostoa ei ole olemassa.";

/* NSFileNoSuchFileError, applied to a folder */
"Err4-C(Folder)" = "Kansiota ei ole olemassa.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "Tiedostoa ”%@” ei ole olemassa.";

/* Message shown when the connection to a helper application is interrupted due to the helper application exiting. */
"Err4097" = "Ei voitu muodostaa yhteyttä apuohjelmaan.";

/* Recovery suggestion for message shown when the connection to a helper application is interrupted. */
"Err4097-R" = "Yritä toimintoa uudelleen. Jos se epäonnistuu, lopeta ohjelma, käynnistä se uudelleen ja yritä uudelleen.";

/* Message shown when the connection to a helper application is interrupted and can not be reestablished. */
"Err4099" = "Ei voitu muodostaa yhteyttä apuohjelmaan.";

/* Recovery suggestion for message shown when the connection to a helper application is interrupted. */
"Err4099-R" = "Yritä toimintoa uudelleen. Jos se epäonnistuu, lopeta ohjelma, käynnistä se uudelleen ja yritä uudelleen.";

/* Message shown when the connection to a helper application is invalidated due to a corrupted response. */
"Err4101" = "Ei voitu muodostaa yhteyttä apuohjelmaan.";

/* Recovery suggestion for message shown when the connection to a helper application is interrupted. */
"Err4101-R" = "Yritä toimintoa uudelleen. Jos se epäonnistuu, lopeta ohjelma, käynnistä se uudelleen ja yritä uudelleen.";

/* NSFileWriteUnknownError */
"Err512" = "Tiedostoa ei voitu tallentaa.";

/* NSFileWriteUnknownError, when the save of the specified file fails because the backup file for the saved file can't be created or updated */
"Err512(Backup).f" = "Tiedostoa ”%1$@” ei voitu tallentaa, koska varmuuskopiotiedostoa ei voitu päivittää.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "Kohdetta ”%1$@” ei voitu kopioida kohteeseen ”%2$@”.";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "Kohdetta ”%1$@” ei voitu linkittää kohteeseen ”%2$@”.";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "Kohdetta ”%1$@” ei voitu siirtää kohteeseen ”%2$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "Kohdetta ”%@” ei voitu poistaa.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Trash).f" = "Tiedostoa ”%@” ei voitu siirtää roskakoriin.";

/* NSFileWriteUnknownError, when the save of a file fails because the backup file can't be created or updated */
"Err512-C(Backup)" = "Varmuuskopiotiedostoa ei voitu tallentaa.";

/* NSFileWriteUnknownError, recovery suggestion for when the save of a file fails because the backup file can't be created or updated */
"Err512-R(Backup)" = "Varmuuskopiotiedosto saattaa olla lukittu tai sinulla ei ole oikeutta tallentaa siihen. Jos haluat katsella tai muuttaa oikeuksia, valitse kohde Finderissa ja valitse Arkisto > Näytä tiedot.";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "Tiedostoa ”%2$@” ei voitu tallentaa kansioon ”%1$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "Tiedostoa ”%@” ei voitu tallentaa.";

/* NSFileWriteNoPermissionError */
"Err513" = "Tiedostoa ei voitu tallentaa, koska sinulla ei ole oikeutta.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "Kohdetta ”%1$@” ei voitu kopioida, koska sinulla ei ole pääsyä kohteeseen ”%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "Kohdetta ”%1$@” ei voitu linkittää, koska sinulla ei ole pääsyä kohteeseen ”%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "Kohdetta ”%1$@” ei voitu siirtää, koska sinulla ei ole pääsyä kohteeseen ”%2$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "Kohdetta ”%@” ei voitu poistaa, koska sinulla ei ole pääsyä kohteeseen.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Trash).f" = "Tiedostoa ”%@” ei voitu siirtää roskakoriin, koska et voi käyttää sitä.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "Sinulla ei ole oikeutta.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "Jos haluat katsella tai muuttaa oikeuksia, valitse kohde Finderissa ja valitse Arkisto > Näytä tietoja.";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "Sinulla ei ole oikeutta tallentaa tiedostoa ”%2$@” kansioon ”%1$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "Sinulla ei ole oikeutta tallentaa tiedostoa ”%@”.";

/* NSFileWriteInvalidFileNameError */
"Err514" = "Kohdetta ei voitu tallentaa, koska tiedostonimi on virheellinen.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "Kohdetta ei voitu poistaa, koska tiedostonimi ”%@” on virheellinen.";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "Tiedostonimi oli virheellinen.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "Kohdetta ei voitu tallentaa, koska tiedostonimi ”%@” on virheellinen.";

/* NSFileWriteFileExistsError */
"Err516" = "Tiedostoa ei voitu tallentaa, koska samanniminen tiedosto on jo olemassa.";

/* NSFileWriteFileExistsError, first arg: source, second arg: destination */
"Err516(Copy).fp" = "Kohdetta ”%1$@” ei voitu kopioida kohteeseen ”%2$@”, koska samanniminen kohde on jo olemassa.";

/* NSFileWriteFileExistsError, first arg: source, second arg: destination */
"Err516(Link).fp" = "Kohdetta ”%1$@” ei voitu linkittää kohteeseen ”%2$@”, koska samanniminen kohde on jo olemassa.";

/* NSFileWriteFileExistsError, first arg: source, second arg: destination */
"Err516(Move).fp" = "Kohdetta ”%1$@” ei voitu siirtää kohteeseen ”%2$@”, koska samanniminen kohde on jo olemassa.";

/* NSFileWriteFileExistsError */
"Err516-C" = "Samanniminen tiedosto on jo olemassa.";

/* NSFileWriteFileExistsError, argument is a file name */
"Err516-C.f" = "Tiedosto nimeltä ”%@” on jo olemassa.";

/* NSFileWriteFileExistsError */
"Err516-R" = "Voit tallentaa tiedoston käyttämällä eri nimeä tai siirtämällä syrjään tai poistamalla nykyisen tiedoston ja yrittämällä uudelleen.";

/* NSFileWriteFileExistsError, first arg: destination folder, second arg: a file name */
"Err516.df" = "Tiedostoa ”%2$@” ei voitu tallentaa kansioon ”%1$@”, koska samanniminen tiedosto on jo olemassa.";

/* NSFileWriteFileExistsError, argument is a file name */
"Err516.f" = "Tiedostoa ”%@” ei voitu tallentaa, koska samanniminen tiedosto on jo olemassa.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "Tiedostoa ei voitu tallentaa käyttäen määriteltyä tekstikoodausta.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "Määriteltyä tekstikoodausta ei voida käyttää.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "Tekstikoodausta %@ ei voida käyttää.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "Jos mahdollista, valitse toinen tekstikoodaus.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "Tiedostoa ei voitu tallentaa käyttäen tekstikoodausta %@.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "Tiedostoa ”%2$@” ei voitu tallentaa käyttäen tekstikoodausta %1$@.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "Tiedostoa ei voitu tallentaa, koska määriteltyä osoitetyyppiä ei tueta.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "Määriteltyä osoitetyyppiä ei tueta.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "Tiedostoa ”%1$@” ei voitu tallentaa, koska osoitetyyppiä %2$@ ei tueta.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "Tiedostoa ei voitu tallentaa, koska osoitetyyppiä %@ ei tueta.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "Tiedostoa ei voitu tallentaa, koska tilaa ei ole tarpeeksi.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "Kohdetta ”%1$@” ei voitu kopioida kohteeseen ”%2$@”, koska siinä ei ole tarpeeksi tilaa.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "Kohdetta ”%1$@” ei voitu linkittää kohteeseen ”%2$@”, koska siinä ei ole tarpeeksi tilaa.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "Kohdetta ”%1$@” ei voitu siirtää kohteeseen ”%2$@”, koska siinä ei ole tarpeeksi tilaa.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640(Trash).f" = "Tiedostoa ”%@” ei voitu siirtää roskakoriin, koska siinä ei ole tarpeeksi tilaa.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "Tilaa ei ole tarpeeksi.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "Taltio ”%@” on täynnä.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "Poista joitakin tiedostoja taltiolta ja yritä uudelleen.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "Tiedostoa ”%@” ei voida tallentaa, koska tilaa ei ole tarpeeksi.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "Tiedostoa ”%1$@” ei voida tallentaa, koska taltio ”%2$@” on täynnä.";

/* NSFileWriteVolumeReadOnlyError */
"Err642" = "Tiedostoa ei voitu tallentaa, koska taltio on kirjoitussuojattu.";

/* NSFileWriteVolumeReadOnlyError, argument is a file name */
"Err642(Trash).f" = "Tiedostoa ”%@” ei voitu siirtää roskakoriin, koska taltio on kirjoitussuojattu.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-C" = "Taltio on kirjoitussuojattu.";

/* NSFileWriteVolumeReadOnlyError, argument is volume name */
"Err642-C.v" = "Taltio ”%@” on kirjoitussuojattu.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-R" = "Yritä tallentaa tiedosto toiselle taltiolle.";

/* NSFileWriteVolumeReadOnlyError, argument is a file name */
"Err642.f" = "Tiedostoa ”%@” ei voida tallentaa, koska taltio on kirjoitussuojattu.";

/* NSFileWriteVolumeReadOnlyError, arguments are file name and volume name */
"Err642.fv" = "Tiedostoa ”%1$@” ei voida tallentaa, koska taltio ”%2$@” on kirjoitussuojattu.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"The operation couldn\\U2019t be completed. (%1$@ error %2$ld.)" = "Toimintoa ei voitu suorittaa. (Virhe %2$ld kohteessa %1$@)";

